#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Sample data

In [6]:
%%sql

SELECT
    a.district
FROM
    address a
WHERE
    a.district = 'Saitama'

[('Saitama',), ('Saitama',), ('Saitama',)]

#### Remove duplicates with `DISTINCT`

In [7]:
%%sql

SELECT DISTINCT
    a.district
FROM
    address a
WHERE
    a.district = 'Saitama'

[('Saitama',)]

#### Using `DISTINCT ON`
The above example was pretty unrealistic, I'll admit. However, you can include more columns and remove duplicates based on just one with `DISTINCT ON`.

In [8]:
%%sql

SELECT
    *
FROM
    address a
WHERE
    a.district = 'Saitama'

[(151, '1337 Lincoln Parkway', '', 'Saitama', 555, '99457', '597815221267', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (401, '168 Cianjur Manor', '', 'Saitama', 228, '73824', '679095087143', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (409, '1266 Laredo Parkway', '', 'Saitama', 380, '7664', '1483365694', datetime.datetime(2006, 2, 15, 9, 45, 30))]

In [17]:
%%sql

SELECT DISTINCT ON (a.district)
    *
FROM
    address a
WHERE
    a.district = 'Saitama'

[(151, '1337 Lincoln Parkway', '', 'Saitama', 555, '99457', '597815221267', datetime.datetime(2006, 2, 15, 9, 45, 30))]

Please remember that the use of `DISTINCT` is often considered 'code smell', meaning it signifies something is wrong with your code. Whenever possible, it's best to avoid duplicates with goods joins and filters instead.